#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_network.vpc_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc_network" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m                   = true
      [32m+[0m [0m[1m[0mbgp_always_compare_med[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mbgp_best_path_selection_mode[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbgp_inter_region_cost[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m           = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                        = (known after apply)
      [32m+[0m [0m[1m[0minternal_ipv6_range[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                                       = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                      = "prod"
      [32m+[0m [0m[1m[0mnetwork_firewall_policy_enforcement_order[0m[0m = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m [0m[1m[0mnetwork_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mnumeric_id[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                                   = "florenciacomuzzi"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                                 = (known after apply)
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @florenciacomuzzi, Action: `pull_request`*